In [1]:
#Imprting neccesary libraries
#data handling libraries

import pandas as pd
import numpy as np

#Data pre-processing Libraries
from sklearn.preprocessing import LabelEncoder

#Data Train_test fit Library
from sklearn.model_selection import train_test_split

#Machine learning Algorithm
from sklearn.tree import DecisionTreeClassifier

#Model Evaluation Library
from sklearn.metrics import accuracy_score

#Imrporting GridSearchCV
from sklearn.model_selection import GridSearchCV

In [2]:
#importing the DataFrame

df = pd.read_excel('ktm.xlsx')

In [3]:
#reading the set of data's imported

df.head()

,ID,Age,Gender,Occupation,Phone Type,Current Bike,Relationship,Response
0,1,53,Male,Professional,Average,180 to 220,Complicated,Not purchased
1,2,27,Female,Self Employed,Low End,No Bike,Single,Purchased
2,3,39,Female,Unemployed,Average,180 to 220,Married,Not purchased
3,4,20,Female,Unemployed,High End,No Bike,Married,Not purchased
4,5,29,Male,Student,Average,180 to 220,Complicated,Purchased

In [4]:
df.drop('ID', axis=1, inplace=True) 
#inplace = true is used : when we want to delete permenantly a column from data

In [5]:
df.head()

,Age,Gender,Occupation,Phone Type,Current Bike,Relationship,Response
0,53,Male,Professional,Average,180 to 220,Complicated,Not purchased
1,27,Female,Self Employed,Low End,No Bike,Single,Purchased
2,39,Female,Unemployed,Average,180 to 220,Married,Not purchased
3,20,Female,Unemployed,High End,No Bike,Married,Not purchased
4,29,Male,Student,Average,180 to 220,Complicated,Purchased

# Label encoding the categorical column

In [6]:
le = LabelEncoder()

In [7]:
df['Gender'] = le.fit_transform(df['Gender'])

In [8]:
df.head()

,Age,Gender,Occupation,Phone Type,Current Bike,Relationship,Response
0,53,1,Professional,Average,180 to 220,Complicated,Not purchased
1,27,0,Self Employed,Low End,No Bike,Single,Purchased
2,39,0,Unemployed,Average,180 to 220,Married,Not purchased
3,20,0,Unemployed,High End,No Bike,Married,Not purchased
4,29,1,Student,Average,180 to 220,Complicated,Purchased

In [9]:
df['Occupation'] = le.fit_transform(df['Occupation'])
df['Phone Type'] = le.fit_transform(df['Phone Type'])
df['Current Bike'] = le.fit_transform(df['Current Bike'])
df['Relationship'] = le.fit_transform(df['Relationship'])
df['Response'] = le.fit_transform(df['Response'])

In [10]:
df.head()

   Age  Gender  Occupation  Phone Type  Current Bike  Relationship  Response
0   53       1           0           0             1             1         0
1   27       0           1           2             4             3         1
2   39       0           3           0             1             2         0
3   20       0           3           1             4             2         0
4   29       1           2           0             1             1         1

In [11]:
#Checking for Null-Values
df.isnull().sum()

Age             0
Gender          0
Occupation      0
Phone Type      0
Current Bike    0
Relationship    0
Response        0
dtype: int64

In [12]:
df.describe()

,Age,Gender,Occupation,Phone Type,Current Bike,Relationship,Response
count,1518.000000,1518.000000,1518.000000,1518.000000,1518.000000,1518.000000,1518.000000
mean,32.731225,0.462451,1.639657,1.002635,1.816864,1.633729,0.574440
std,13.258555,0.498752,0.968826,0.670496,1.410267,1.146590,0.494591
min,18.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,22.000000,0.000000,1.000000,1.000000,1.000000,1.000000,0.000000
50%,28.000000,0.000000,2.000000,1.000000,2.000000,2.000000,1.000000
75%,44.000000,1.000000,2.000000,1.000000,3.000000,3.000000,1.000000
max,60.000000,1.000000,3.000000,2.000000,4.000000,3.000000,1.000000

In [13]:
#collecting independent features

x = df.drop('Response', axis=1)

In [14]:
x.head()

   Age  Gender  Occupation  Phone Type  Current Bike  Relationship
0   53       1           0           0             1             1
1   27       0           1           2             4             3
2   39       0           3           0             1             2
3   20       0           3           1             4             2
4   29       1           2           0             1             1

In [15]:
#collecting dependent feature

y = df[["Response"]]
y.head()

   Response
0         0
1         1
2         0
3         0
4         1

In [16]:
#Train_test_split
xtrain, xtest, ytrain, ytest = train_test_split(x,y,test_size=0.3, random_state=50)

In [17]:
xtest

      Age  Gender  Occupation  Phone Type  Current Bike  Relationship
1253   22       0           2           1             1             3
233    37       1           3           0             1             2
1436   18       1           2           1             3             2
910    54       0           0           2             1             2
21     19       1           3           1             3             0
...   ...     ...         ...         ...           ...           ...
1318   19       1           2           1             0             0
770    52       1           0           2             0             2
1372   24       0           2           1             1             2
498    41       1           0           0             4             2
861    51       1           1           0             0             3

[456 rows x 6 columns]

In [18]:
xtrain

      Age  Gender  Occupation  Phone Type  Current Bike  Relationship
93     46       1           1           2             2             2
966    40       1           1           1             4             1
765    55       1           0           2             0             0
785    56       1           2           0             0             3
1419   18       1           2           1             4             1
...   ...     ...         ...         ...           ...           ...
70     18       0           1           1             0             3
132    57       0           3           2             4             2
1313   18       1           2           1             1             0
109    31       1           0           0             3             2
1504   18       1           2           1             1             3

[1062 rows x 6 columns]

In [19]:
ytest

      Response
1253         1
233          0
1436         1
910          0
21           0
...        ...
1318         1
770          0
1372         1
498          1
861          1

[456 rows x 1 columns]

In [20]:
ytrain

      Response
93           1
966          0
765          0
785          0
1419         1
...        ...
70           0
132          0
1313         1
109          0
1504         1

[1062 rows x 1 columns]

# Model Building

In [21]:
dt = DecisionTreeClassifier()

In [22]:
#Always fit the model on training data i.e, x_train and y_train


dt.fit(xtrain,ytrain)

DecisionTreeClassifier()

In [23]:
#We Test Model's performance by Testing the data

dt_pred = dt.predict(xtest)

In [24]:

dt_pred

array([1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1,
       1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1,
       1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0,
       1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1,
       0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0,
       1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1,
       0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0,
       0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1,
       0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1,
       0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1,
       0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0,
       1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0,
       0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1])

# Model Evaluation

In [25]:
accuracy_score(ytest,dt_pred)  #accuracy of DT before cross validation

0.7697368421052632

In [26]:
dt_pred1 = dt.predict(xtrain)

In [27]:
accuracy_score(ytrain,dt_pred1)

0.995291902071563

### Decision Tree is a overfitting Model. It basically gives good accuracy fot the training data and gives poor accuracy for testing Data. In Other terms it overfits the training data and cannot Generalize the test Data

## Implementing Stratified K-fold Cross Validation

In [28]:
from sklearn.model_selection import StratifiedKFold

In [29]:
stf = StratifiedKFold(n_splits=10)

In [30]:
stf

StratifiedKFold(n_splits=10, random_state=None, shuffle=False)

In [31]:
stf.get_n_splits(X=x, y=y)  #how many split it will create on x,y Data

10

In [32]:
dt = DecisionTreeClassifier()

In [33]:

accuracy = []
for train_index, test_index in stf.split(x,y):
    #print('Train = ',train_index,'Test = ',test_index)
    x1_train, x1_test = x.iloc[train_index], x.iloc[test_index]   #spliting using stratified K-fold 
    y1_train, y1_test = y.iloc[train_index], y.iloc[test_index]
    dt.fit(x1_train,y1_train)
    pred = dt.predict(x1_test)
    acc = accuracy_score(y1_test,pred)
    accuracy.append(acc)

In [34]:
accuracy

[0.5131578947368421,
 0.5328947368421053,
 0.5328947368421053,
 0.6513157894736842,
 0.868421052631579,
 0.9013157894736842,
 0.8486842105263158,
 0.8552631578947368,
 0.8741721854304636,
 0.8609271523178808]

In [35]:
len(accuracy)

10

In [36]:
np.mean(accuracy) #final accuracy of Decision tree after cross validation

0.7439046706169398

## Hyper-Parameter Tunning

In [37]:
dt_tune = DecisionTreeClassifier()

In [38]:
param_dt = {'criterion':['gini','entropy'], 'max_depth':[1,2,3,4,5,6,7,8,9,10], 'splitter':['best','random']}

In [39]:
model = GridSearchCV(dt_tune,param_dt)

In [40]:
model.fit(x,y)

GridSearchCV(estimator=DecisionTreeClassifier(),
             param_grid={'criterion': ['gini', 'entropy'],
                         'max_depth': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
                         'splitter': ['best', 'random']})

In [41]:
model.best_params_  #3 best parameters

{'criterion': 'entropy', 'max_depth': 1, 'splitter': 'best'}

In [42]:
dt_tune = DecisionTreeClassifier(criterion='entropy', max_depth=1, splitter='best')

In [43]:
dt_tune.fit(xtrain, ytrain)

DecisionTreeClassifier(criterion='entropy', max_depth=1)

In [44]:
pred = dt_tune.predict(xtest)

In [45]:
accuracy_score(ytest,pred)

0.7828947368421053

## Post -Hyperparameter Tunning

## Adaboost

In [46]:
from sklearn.ensemble import AdaBoostClassifier

# Create adaboost classifer object
abc = AdaBoostClassifier(n_estimators=50, learning_rate=1)

In [47]:
# Train Adaboost Classifer
model = abc.fit(xtrain, ytrain)

C:\Users\GOD\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

In [48]:
#Predict the response for test dataset
y_pred = model.predict(xtest)

In [49]:
# Model Accuracy
print("Accuracy:", accuracy_score(ytest, y_pred))

Accuracy: 0.7785087719298246

In [50]:
# USing UserdefinedFunction

def my_tts(x, y, model):
    xtrain, xtest, ytrain, ytest = train_test_split(x, y, test_size=0.3, random_state=50)
    model = model()
    model.fit(x,y)
    model.fit(xtrain, ytrain)
    pred = model.predict(xtest)
    accuracy_test = accuracy_score(ytest, pred)
    pred1 = model.predict(xtrain)
    accuracy_train = accuracy_score(ytrain, pred1)
    print("Test Accuracy :",accuracy_test) 
    print("Train Accuracy:", accuracy_train)

In [51]:
my_tts(x, y, model = AdaBoostClassifier)

C:\Users\GOD\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)
C:\Users\GOD\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

Test Accuracy : 0.7785087719298246
Train Accuracy: 0.7862523540489642

# Gradient Boost

In [53]:
from sklearn.ensemble import GradientBoostingClassifier

# Create adaboost classifer object
Gbc = GradientBoostingClassifier()

In [54]:
my_tts(x, y, model=Gbc)

TypeError: 'GradientBoostingClassifier' object is not callable